app/Models/home_model.php

    function HOMAgregarUsuario($datosGenerales) {
        $comprobacion =  $this->comprobarUsuario($datosGenerales["usuario"]);
        if (!$comprobacion) {
            return false;
        }
        $insercion = $this->prepararDatosAgregarUsuario($datosGenerales);
        try {
            $this->db->transException(true)->transStart();

            $tabla = $this->db->table("cat_usuarios");

            $tabla->insert($insercion);
---
INSERT INTO `cat_usuarios` (`usuario`, `contraseña`, `fecharegistro`, `activo`) VALUES ('pedro', 'Juanlo12', '2024-07-06', 'S')