app/Models/home_model.php

SELECT `idusuario`
FROM `cat_usuarios`
WHERE `usuario` = 'principal'
AND `contraseña` = 'Pr1ncipal.'
AND `activo` = 'S'
---
    function HOMIniciarSesion($datosGenerales) {
        $tabla = $this->db->table("cat_usuarios");

        $tabla->select("idusuario");

        $tabla->where("usuario", $datosGenerales["usuario"])
              ->where("contraseña", $datosGenerales["contraseña"])
              ->where("activo", "S");

        $resultado = $tabla->get()->getRow();

SELECT *
FROM `cat_usuarios`
---
    function HOMObtenerUsuarios() {
        $tabla = $this->db->table("cat_usuarios");

        $tabla->select("*");

        return $tabla->get()->getResult();

SELECT *
FROM `cat_usuarios`
WHERE `idusuario` = '1'
---
    function HOMObtenerUsuario($idUsuario) {
        $tabla = $this->db->table("cat_usuarios");

        $tabla->select("*");

        $tabla->where("idusuario", $idUsuario);

        return $tabla->get()->getRow();

UPDATE `cat_usuarios` SET `usuario` = 'principal', `contraseña` = 'Pr1ncipal', `activo` = 'S'
WHERE `idusuario` = '1'
---
    function HOMEditarUsuario($datosGenerales) {
        $comprobacion =  $this->comprobarUsuarioEditar($datosGenerales["idUsuario"] ,$datosGenerales["usuario"]);
        if ($comprobacion) {
            return false;
        }
        $actualizacion = $this->prepararDatosActualizarUsuario($datosGenerales);

        try {
            $this->db->transException(true)->transStart();

            $tabla = $this->db->table("cat_usuarios");

            $tabla->where("idusuario", $datosGenerales["idUsuario"]);
            $tabla->update($actualizacion);

SELECT `idusuario`
FROM `cat_usuarios`
WHERE `idusuario` != '1'
AND `usuario` = 'principal'
---
    function comprobarUsuarioEditar($idUsuario, $usuario) {
        $tabla = $this->db->table("cat_usuarios");

        $tabla->select("idusuario");

        $tabla->where("idusuario !=", $idUsuario)
              ->where("usuario", $usuario);

        $resultado = $tabla->get()->getRow();

UPDATE `cat_usuarios` SET `activo` = 'N'
WHERE `idusuario` = '2'
---
    function HOMDeshabilitarUsuario($idUsuario) {
        $actualizacion = $this->prepararDatosDeshabilitarUsuario();
        try {
            $this->db->transException(true)->transStart();

            $tabla = $this->db->table("cat_usuarios");

            $tabla->where("idusuario", $idUsuario);
            $tabla->update($actualizacion);

DELETE FROM `cat_usuarios`
WHERE `idusuario` = '2'
---
    function HOMEliminarUsuario($idUsuario) {
        try {
            $this->db->transException(true)->transStart();

            $tabla = $this->db->table("cat_usuarios");

            $tabla->where("idusuario", $idUsuario);
            $tabla->delete();